НЭС_ЗУП/src/InformationRegisters/РезультатыСпециальнойОценкиУсловийТруда/РезультатыСпециальнойОценкиУсловийТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыСпециальнойОценкиУсловийТруда</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КлассУсловийТруда</name>
    <type>
      <types>EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ВыявленыВредныеОпасныеФакторы</name>
    <comment>АПК:58 Различия имени и синонима оправданы</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаОхраныТруда</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

НЭС_ЗУП/src/InformationRegisters/КлассыУсловийТрудаПоДолжностям/КлассыУсловийТрудаПоДолжностям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлассыУсловийТрудаПоДолжностям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КлассУсловийТруда</name>
    <type>
      <types>EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрацииИзменений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыявленыВредныеОпасныеФакторы</name>
    <comment>АПК:58 Различия имени и синонима оправданы</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РезультатыСпецоценкиУсловийТруда</types>
      <types>DocumentRef.УтверждениеШтатногоРасписания</types>
      <types>DocumentRef.ИзменениеШтатногоРасписания</types>
    </type>
  </attributes>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>DefinedType.УсловияТруда</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

НЭС_ЗУП/src/InformationRegisters/РезультатыСпециальнойОценкиУсловийТруда/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Регистраторы = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(ЭтотОбъект, Замещение, "Регистратор");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредыдущийНабор.Должность КАК Должность,
	|	ПредыдущийНабор.Период КАК Период,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРегистрацииИзменений,
	|	NULL КАК КлассУсловийТруда,
	|	ЛОЖЬ КАК ВыявленыВредныеОпасныеФакторы,
	|	NULL КАК Основание,
	|	ИСТИНА КАК УдалитьЗапись
	|ИЗ
	|	РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК ПредыдущийНабор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда КАК ТекущийНабор
	|		ПО ПредыдущийНабор.Должность = ТекущийНабор.РабочееМесто
	|			И ПредыдущийНабор.Период = ТекущийНабор.Период
	|			И ПредыдущийНабор.Основание = ТекущийНабор.Регистратор
	|ГДЕ
	|	ПредыдущийНабор.Основание В (&Регистраторы)
	|	И ТекущийНабор.РабочееМесто ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТекущийНабор.РабочееМесто,
	|	ТекущийНабор.Период,
	|	НАЧАЛОПЕРИОДА(ТекущийНабор.Период, МЕСЯЦ),
	|	ТекущийНабор.КлассУсловийТруда,
	|	ТекущийНабор.ВыявленыВредныеОпасныеФакторы,
	|	ТекущийНабор.Регистратор,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда КАК ТекущийНабор
	|ГДЕ
	|	ТекущийНабор.Регистратор В (&Регистраторы)
	|	И ТекущийНабор.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)"; 
	
	НачатьТранзакцию();
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.КлассыУсловийТрудаПоДолжностям");
			ЭлементБлокировки.УстановитьЗначение("Должность", Выборка.Должность);
			ЭлементБлокировки.УстановитьЗначение("Период", Выборка.Период);
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.КлассыУсловийТрудаПоДолжностям.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Должность.Установить(Выборка.Должность);
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
			
			Если Выборка.УдалитьЗапись Тогда
				НаборЗаписей.Записать();
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.КлассУсловийТруда) Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
